on-par-backend/app/controllers/departments_controller.rb

    def index
        departments = Department.all
---
SELECT "departments".* FROM "departments"

    def create
       department = Department.new(department_params)
       department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cosmetics"], ["created_at", "2020-08-27 14:37:57.802927"], ["updated_at", "2020-08-27 14:37:57.802927"]]