on-par-backend/app/controllers/items_controller.rb

    def index
        items = Item.all
---
SELECT "items".* FROM "items"

    def show
        item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
        item = Item.new(item_params)
        if item.save
---
INSERT INTO "items" ("name", "on_hand", "par", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Hair Dryer"], ["on_hand", 4], ["par", 8], ["department_id", 10], ["created_at", "2020-08-28 22:11:16.853264"], ["updated_at", "2020-08-28 22:11:16.853264"]]

    def destroy
        item = Item.find(params[:id])
        item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 5]]

    def update
        item = Item.find(params[:id])
        item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "on_hand" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["on_hand", 39], ["updated_at", "2020-08-27 17:48:54.309033"], ["id", 3]]